{
  "pink primrose": "Oenothera speciosa is a species in the Oenothera family known by several common names, including pinkladies, pink evening primrose, showy evening primrose, Mexican primrose, amapola, and buttercups.",
  "hard-leaved pocket orchid": "Paphiopedilum micranthum, described in 1951, is commonly known as the silver slipper orchid or hard-leaved pocket orchid. It blooms during late winter to early summer with one flower per inflorescence. As opposed to its close sibling Paph. malipoense, the flowers of Paph. micranthum have no fragrance.",
  "canterbury bells": "Campanula medium, common name Canterbury bells, is an annual or biennial flowering plant of the genus Campanula, belonging to the family Campanulaceae. In floriography, it represents gratitude, or faith and constancy.",
  "sweet pea": "The sweet pea, Lathyrus odoratus, is a flowering plant in the genus Lathyrus in the family Fabaceae, native to Sicily, southern Italy and the Aegean Islands.\nIt is an annual climbing plant, growing to a height of 1–2 metres, where suitable support is available.",
  "marigold": "Tagetes is a genus of 50 species of annual or perennial, mostly herbaceous plants in the family Asteraceae. They are among several groups of plants known in English as marigolds. The genus Tagetes was described by Carl Linnaeus in 1753.",
  "tiger lily": "Lilium lancifolium is an Asian species of lily, native to China, Japan, Korea, and the Russian Far East.",
  "moon orchid": "Phalaenopsis amabilis, commonly known as the moon orchid, moth orchid, or mariposa orchid, is a species of flowering plant in the orchid family Orchidaceae. It is widely cultivated as a decorative houseplant.",
  "bird of paradise": "Strelitzia is a genus of five species of perennial plants, native to South Africa. It belongs to the plant family Strelitziaceae. A common name of the genus is bird of paradise flower/plant, because of a resemblance of its flowers to birds-of-paradise. In South Africa, it is commonly known as a crane flower.",
  "monkshood": "Aconitum, also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae.",
  "globe thistle": "Echinops is a genus of about 120 species of flowering plants in the family Asteraceae, commonly known as globe thistles. They have spiny foliage and produce blue or white spherical flower heads. They are native to Europe, east to central Asia, and south to the mountains of tropical Africa.",
  "snapdragon plant": "Antirrhinum is a genus of plants commonly known as dragon flowers, snapdragons and dog flower because of the flowers' fancied resemblance to the face of a dragon that opens and closes its mouth when laterally squeezed. They are native to rocky areas of Europe, the United States, Canada, and North Africa.",
  "colt's foot": "Tussilago farfara, commonly known as coltsfoot, is a plant in the tribe Senecioneae in the family Asteraceae, native to Europe and parts of western and central Asia. The name \"tussilago\" is derived from the Latin tussis, meaning cough, and ago, meaning to cast or to act on.",
  "king protea": "Protea cynaroides, also called the king protea, is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot or king sugar bush.",
  "spear thistle": "Cirsium vulgare, the spear thistle, bull thistle, or common thistle, is a species of the Asteraceae genus Cirsium, native throughout most of Europe, Western Asia, and northwestern Africa. It is also naturalised in North America, Africa, and Australia and is an invasive weed in some areas.",
  "yellow iris": "Iris pseudacorus, the yellow flag, yellow iris, or water flag, is a species of flowering plant in the family Iridaceae. It is native to Europe, western Asia and northwest Africa.",
  "globe-flower": "Trollius is a genus of about 30 species of flowering plants closely related to Ranunculus, in the family Ranunculaceae. The common name of some species is globeflower or globe flower. The generic name is derived from the Swiss-German word \"Trollblume\", meaning a rounded flower.",
  "purple coneflower": "Echinacea is a genus of herbaceous flowering plants in the daisy family. It has ten species, which are commonly called coneflowers. They are found only in eastern and central North America, where they grow in moist to dry prairies and open wooded areas.",
  "peruvian lily": "Alstroemeria, commonly called the Peruvian lily or lily of the Incas, is a genus of flowering plants in the family Alstroemeriaceae. They are all native to South America, although some have become naturalized in the United States, Mexico, Australia, New Zealand, Madeira and the Canary Islands.",
  "balloon flower": "Platycodon grandiflorus is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia. It is commonly known as balloon flower, Chinese bellflower, or platycodon.",
  "white arum lily": "Zantedeschia aethiopica, commonly known as calla lily and arum lily, is a species of flowering plant in the family Araceae, native to southern Africa in Lesotho, South Africa, and Eswatini.",
  "fire lily": "Gloriosa is a genus of 12 species in the plant family Colchicaceae, and includes the formerly recognised genus Littonia. They are native in tropical and southern Africa to Asia, and naturalised in Australia and the Pacific as well as being widely cultivated.",
  "pincushion flower": "Scabiosa japonica is a species of flowering plant in the pincushion flower genus Scabiosa, native to central and southern Japan, and introduced to the Dominican Republic. A biennial or short-lived perennial reaching 10 to 50 cm, the Royal Horticultural Society considers it a good plant to attract pollinators.",
  "fritillary": "Fritillaria is a genus of spring flowering herbaceous bulbous perennial plants in the lily family. The type species, Fritillaria meleagris, was first described in Europe in 1571, while other species from the Middle East and Asia were also introduced to Europe at that time.",
  "red ginger": "Alpinia purpurata, commonly referred to as red ginger, also called ostrich plume and pink cone ginger, are native Malaysian plants with showy flowers on long brightly colored red bracts. They look like the bloom, but the true flower is the small white flower on top.",
  "grape hyacinth": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth, but they should not be confused with hyacinths.",
  "corn poppy": "Papaver rhoeas, with common names including common poppy, corn poppy, corn rose, field poppy, Flanders poppy, and red poppy, is an annual herbaceous species of flowering plant in the poppy family Papaveraceae.",
  "prince of wales feathers plant": "Amaranthus hypochondriacus is an ornamental plant commonly known as Prince-of-Wales feather or prince's-feather. Originally endemic to Mexico, it is called quelite, bledo and quintonil in Spanish.\nIn Africa and El Salvador, like many other species in the family Amaranthaceae, it is valued as source of food.",
  "stemless gentian": "Gentiana acaulis, the stemless gentian, or trumpet gentian, is a species of flowering plant in the family Gentianaceae, native to central and southern Europe, from Spain east to the Balkans, growing especially in mountainous regions, such as the Alps and Pyrenees, at heights of 800–3,000 m.",
  "artichoke": "The globe artichoke, also known by the names French artichoke and green artichoke in the U.S., is a variety of a species of thistle cultivated as food.\nThe edible portion of the plant consists of the flower buds before the flowers come into bloom.",
  "sweet william": "Dianthus barbatus, the sweet William, is a species of flowering plant in the family Caryophyllaceae, native to southern Europe and parts of Asia. It has become a popular ornamental garden plant.",
  "carnation": "Dianthus caryophyllus, commonly known as the carnation or clove pink, is a species of Dianthus. It is likely native to the Mediterranean region but its exact range is unknown due to extensive cultivation for the last 2,000 years.",
  "garden phlox": "Phlox paniculata is a species of flowering plant in the phlox family. It is native to parts of the eastern and central United States. It is extensively cultivated in temperate regions as an ornamental plant and has become established in the wild in scattered locales in other regions.",
  "love in the mist": "Nigella damascena, love-in-a-mist, or devil in the bush, is an annual garden flowering plant, belonging to the buttercup family Ranunculaceae.\nIt is native to southern Europe, north Africa and southwest Asia, where it is found on neglected, damp patches of land.",
  "mexican aster": "Cosmos is a genus, with the same common name of cosmos, consisting of flowering plants in the sunflower family.",
  "alpine sea holly": "Eryngium alpinum, the alpine sea holly, alpine eryngo or queen of the Alps, is a herbaceous perennial plant in the family Apiaceae.",
  "cattleya labiata": "Cattleya labiata, also known as the crimson cattleya or ruby-lipped cattleya, is the type species of Cattleya, discovered in 1818 in Brazil.\nThis plant grows in the northeastern area of Brazil, in the states of Pernambuco and Alagoas. They grow to different sizes depending on the area from which they originate.",
  "cape flower plant": "Tecoma capensis, the Cape honeysuckle, is a species of flowering plant in the family Bignoniaceae, native to southern Africa. Despite its common name, it is not closely related to the true honeysuckle.",
  "great masterwort": "Astrantia major, the great masterwort, is a species of flowering plant in the family Apiaceae, native to central and eastern Europe. Growing up to 90 cm tall by 45 cm broad, it is an herbaceous perennial, much used in gardens.",
  "siam tulip": "Curcuma alismatifolia, Siam tulip or summer tulip is a tropical plant native to Laos, northern Thailand, and Cambodia. Despite its name, it is not related to the tulip, but to the various ginger species such as turmeric. It can grow as an indoor plant, and is also sold as a cut flower.",
  "lenten rose": "Helleborus orientalis, the Lenten rose, is a perennial flowering plant and species of hellebore in the buttercup family, Ranunculaceae, native to Greece and Turkey.",
  "barbeton daisy": "Gerbera jamesonii is a species of flowering plant in the genus Gerbera belonging to the basal Mutisieae tribe within the large Asteraceae family. It is indigenous to South Eastern Africa and commonly known as the Barberton daisy, the Transvaal daisy, and as Barbertonse madeliefie or Rooigousblom in Afrikaans.",
  "daffodil": "Narcissus is a genus of predominantly spring flowering perennial plants of the amaryllis family, Amaryllidaceae. Various common names including daffodil, narcissus, and jonquil are used to describe all or some members of the genus.",
  "sword lily": "Gladiolus is a genus of perennial cormous flowering plants in the iris family.\nIt is sometimes called the 'sword lily', but is usually called by its generic name.\nThe genus occurs in Asia, Mediterranean Europe, South Africa, and tropical Africa. The center of diversity is in the Cape Floristic Region.",
  "poinsettia": "The poinsettia is a commercially important flowering plant species of the diverse spurge family Euphorbiaceae. Indigenous to Mexico and Central America, the poinsettia was first described by Europeans in 1834. It is particularly well known for its red and green foliage and is widely used in Christmas floral displays.",
  "bolero deep blue": "Eustoma russellianum is a species of flowering plant in the gentian family. Its previous binomial name was Eustoma grandiflorum. Common names include Texas bluebells, Texas bluebell, bluebell, showy prairie gentian, prairie gentian, and Lisianthus.\nThere is a cultivar, 'Bolero Deep Blue'.",
  "wallflower plant": "Erysimum, or wallflower, is a genus of flowering plants in the cabbage family, Brassicaceae. It includes more than 150 species, both popular garden plants and many wild forms. The genus Cheiranthus is sometimes included here in whole or in part.",
  "buttercup plant": "Ranunculus is a large genus of about almost 1700 to more than 1800 species of flowering plants in the family Ranunculaceae. Members of the genus are known as buttercups, spearworts and water crowfoots.\nThe genus is distributed in Europe, North America and South America.",
  "oxeye daisy": "Leucanthemum vulgare, commonly known as the ox-eye daisy, oxeye daisy, dog daisy, marguerite and other common names, is a widespread flowering plant native to Europe and the temperate regions of Asia, and an introduced plant to North America, Australia and New Zealand.",
  "common dandelion": "Taraxacum officinale, the dandelion or common dandelion, is a flowering herbaceous perennial plant of the dandelion genus in the family Asteraceae. The common dandelion is well known for its yellow flower heads that turn into round balls of many silver-tufted fruits that disperse in the wind.",
  "petunia": "Petunia is genus of 20 species of flowering plants of South American origin. The popular flower of the same name derived its epithet from the French, which took the word petun, meaning \"tobacco,\" from a Tupi–Guarani language. A tender perennial, most of the varieties seen in gardens are hybrids.",
  "wild pansy plant": "Viola tricolor is a common European wild flower, growing as an annual or short-lived perennial. The species is also known as wild pansy, Johnny Jump up, heartsease, heart's ease, heart's delight, ...",
  "primula": "Primula is a genus of herbaceous flowering plants in the family Primulaceae. They include the primrose, a familiar wildflower of banks and verges. Other common species are P. auricula, P. veris, and P. elatior. These species and many others are valued for their ornamental flowers.",
  "sunflower plant": "Helianthus is a genus comprising about 70 species of annual and perennial flowering plants in the daisy family Asteraceae commonly known as sunflowers. Except for three South American species, the species of Helianthus are native to North America and Central America. The best-known species is the common sunflower.",
  "pelargonium": "Pelargonium is a genus of flowering plants that includes about 280 species of perennials, succulents, and shrubs, commonly called geraniums, pelargoniums, or storksbills. Geranium is also the botanical name and common name of a separate genus of related plants, also known as cranesbills.",
  "dahlia bishop of llandaff": "'Bishop of Llandaff' is a cultivar of the dahlia, a garden plant. It is a branching, tuberous tender perennial with dark purple, almost black, foliage. This produces a stunning contrast with its scarlet flowers. The plant was first bred by Fred Treseder, a Cardiff nurseryman.",
  "gaura": "Gaura is a genus of flowering plants in the family Onagraceae, native to North America. The genus includes many species known commonly as beeblossoms.",
  "geranium": "Geranium is a genus of 422 species of annual, biennial, and perennial plants that are commonly known as geraniums or cranesbills. They are found throughout the temperate regions of the world and the mountains of the tropics, with the greatest diversity in the eastern part of the Mediterranean region.",
  "dahlia": "Dahlia is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico and Central America. A member of the Asteraceae family of dicotyledonous plants, its relatives thus include the sunflower, daisy, chrysanthemum, and zinnia.",
  "dahlia plant": "Dahlia is a genus of bushy, tuberous, herbaceous perennial plants native to Mexico and Central America. A member of the Asteraceae family of dicotyledonous plants, its relatives thus include the sunflower, daisy, chrysanthemum, and zinnia.",
  "cautleya spicata": "Cautleya spicata is a perennial herbaceous plant in the family Zingiberaceae. It is found in the Himalayas through to China. It is cultivated as an ornamental garden plant, hardy to a few degrees of frost.",
  "japanese anemone": "Eriocapitella hupehensis, a species of flowering plant in the buttercup family Ranunculaceae, is native to Asia. The specific epithet hupehensis, which means \"from Hupeh province, China\", refers to a region where the species is known to occur.",
  "black-eyed susan": "Rudbeckia hirta, commonly called black-eyed Susan, is a North American flowering plant in the family Asteraceae, native to Eastern and Central North America and naturalized in the Western part of the continent as well as in China.",
  "silverbush": "Convolvulus cneorum, the silverbush or shrubby bindweed, is a species of flowering plant in the family Convolvulaceae, which contains many plants described as \"bindweed\". The Latin specific epithet cneorum is a word of Greek origin referring to a small olive-like plant, possibly a species of Daphne.",
  "californian poppy": "Eschscholzia californica, the California poppy, golden poppy, California sunlight or cup of gold, is a species of flowering plant in the family Papaveraceae, native to the United States and Mexico.",
  "osteospermum": "Osteospermum, is a genus of flowering plants belonging to the Calenduleae, one of the smaller tribes of the sunflower/daisy family Asteraceae. They are known as the daisybushes or African daisies.",
  "spring crocus": "Crocus vernus is a species in Family Iridaceae, native to the Alps, the Pyrenees, and the Balkans. Its cultivars and those of Crocus flavus are used as ornamental plants. The Dutch crocuses are larger than the other cultivated crocus species.",
  "iris": "Iris is a flowering plant genus of 310 accepted species with showy flowers. As well as being the scientific name, iris is also widely used as a common name for all Iris species, as well as some belonging to other closely related genera.",
  "windflower": "Anemone is a genus of flowering plants in the buttercup family Ranunculaceae. Plants of the genus are commonly called windflowers. They are native to the temperate and subtropical regions of all continents except Australia, New Zealand and Antarctica.",
  "tree poppy plant": "Romneya coulteri, the Coulter's Matilija poppy or California tree poppy, is a perennial species of flowering plant in the poppy family Papaveraceae.",
  "gazania": "Gazania is a genus of flowering plants in the family Asteraceae, native to Southern Africa.\nThey produce large, daisy-like composite flowerheads in brilliant shades of yellow and orange, over a long period in summer. They are often planted as drought-tolerant groundcover.",
  "azalea": "Azaleas are flowering shrubs in the genus Rhododendron, particularly the former sections Tsutsusi and Pentanthera. Azaleas bloom in the spring, their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the family Ericaceae.",
  "water lily": "Nymphaeaceae is a family of flowering plants, commonly called water lilies. They live as rhizomatous aquatic herbs in temperate and tropical climates around the world. The family contains nine genera with about 70 known species.",
  "rose plant": "A rose is either a woody perennial flowering plant of the genus Rosa, in the family Rosaceae, or the flower it bears. There are over three hundred species and tens of thousands of cultivars.",
  "thorn apple": "Datura stramonium, known by the common names thorn apple, jimsonweed, devil's snare, or devil's trumpet, is a poisonous flowering plant of the nightshade family Solanaceae. It is a species belonging to the Datura genus and Daturae tribe.",
  "morning glory": "Morning glory is the common name for over 1,000 species of flowering plants in the family Convolvulaceae, whose current taxonomy and systematics are in flux.",
  "passion flower": "Passiflora, known also as the passion flowers or passion vines, is a genus of about 550 species of flowering plants, the type genus of the family Passifloraceae.\nThey are mostly tendril-bearing vines, with some being shrubs or trees. They can be woody or herbaceous.",
  "lotus plant": "Nelumbo nucifera, also known as sacred lotus, Laxmi lotus, Indian lotus, or simply lotus, is one of two extant species of aquatic plant in the family Nelumbonaceae. It is sometimes colloquially called a water lily, though this more often refers to members of the family Nymphaeaceae.",
  "toad lily": "Tricyrtis hirta, the toad lily or hairy toad lily, is a Japanese species of hardy herbaceous perennial plant in the lily family Liliaceae.\nIt is found growing on shaded rocky cliffs and stream banks in central and southern Japan. Leaves are large and wide, clasping around the stem.",
  "anthurium": "Anthurium is a genus of about 1,000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, and laceleaf.",
  "frangipani": "Plumeria, also known as frangipani, is a genus of flowering plants in the subfamily Rauvolfioideae, of the family Apocynaceae. Most species are deciduous shrubs or small trees. The species variously are endemic to the Neotropical realm, but are sometimes grown as cosmopolitan ornamentals in warm regions.",
  "clematis": "Clematis is a genus of about 380 species within the buttercup family, Ranunculaceae. Their garden hybrids and cultivars have been popular among gardeners, beginning with Clematis 'Jackmanii', a garden standby since 1862; more cultivars are being produced constantly. They are mainly of Chinese and Japanese origin.",
  "hibiscus": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world.",
  "columbine plant": "Aquilegia is a genus of about 60–70 species of perennial plants that are found in meadows, woodlands, and at higher altitudes throughout the Northern Hemisphere, known for the spurred petals of their flowers.",
  "desert-rose plant": "Adenium obesum is a poisonous species of flowering plant belonging to the tribe Nerieae of the subfamily Apocynoideae of the dogbane family, Apocynaceae. It is native to the Sahel regions south of the Sahara, tropical and subtropical eastern and southern Africa and also the Arabian Peninsula.",
  "tree mallow": "Malva arborea, the tree mallow, is a species of mallow native to the coasts of western Europe and the Mediterranean region, from Ireland and Britain south to Algeria and Libya, and east to Greece.",
  "magnolia plant": "Magnolia is a large genus of about 210 to 340 flowering plant species in the subfamily Magnolioideae of the family Magnoliaceae. It is named after French botanist Pierre Magnol.\nMagnolia is an ancient genus. Appearing before bees evolved, the flowers are theorized to have evolved to encourage pollination by beetles.",
  "cyclamen ": "Cyclamen is a genus of 23 species of perennial flowering plants in the family Primulaceae. Cyclamen species are native to Europe and the Mediterranean Basin east to the Caucasus and Iran, with one species in Somalia.",
  "watercress": "Watercress or yellowcress is a species of aquatic flowering plant in the cabbage family Brassicaceae.\nWatercress is a rapidly growing perennial plant native to Europe and Asia. It is one of the oldest known leaf vegetables consumed by humans.",
  "canna lily": "Canna or canna lily is the only genus of flowering plants in the family Cannaceae, consisting of 10 species.",
  "hippeastrum ": "Hippeastrum is a genus of about 90 species and over 600 hybrids and cultivars of perennial herbaceous bulbous plants. They generally have large fleshy bulbs and tall broad leaves, generally evergreen, and large red or purple flowers.\nHippeastrum is a genus in the family Amaryllidaceae.",
  "bee balm": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bergamot, bee balm, horsemint, and oswego tea, the first being inspired by the fragrance of the leaves, which is reminiscent of bergamot orange.",
  "ball moss": "Tillandsia recurvata, commonly known as small ballmoss or ball moss, is a flowering plant in the family Bromeliaceae that grows upon larger host plants. It grows well in areas with low light, little airflow, and high humidity, which is commonly provided by southern shade trees, often the southern live oak.",
  "foxglove": "Digitalis is a genus of about 20 species of herbaceous perennial plants, shrubs, and biennials, commonly called foxgloves.\nDigitalis is native to Europe, western Asia, and northwestern Africa.",
  "bougainvillea": "Bougainvillea is a genus of thorny ornamental vines, bushes, and trees belonging to the four o' clock family, Nyctaginaceae. It is native to eastern South America, found from Brazil, west to Peru, and south to southern Argentina. Different authors accept from 4 to 22 species in the genus.",
  "camellia": "Camellia is a genus of flowering plants in the family Theaceae. They are found in tropical and subtropical areas in eastern and southern Asia, from the Himalayas east to Japan and Indonesia. There are more than 220 described species.",
  "mallow": "Malva is a genus of herbaceous annual, biennial, and perennial plants in the family Malvaceae. It is one of several closely related genera in the family to bear the common English name mallow. The genus is widespread throughout the temperate, subtropical and tropical regions of Africa, Asia and Europe.",
  "mexican bluebell": "Ruellia simplex, the Mexican petunia, Mexican bluebell or Britton's wild petunia, is a species of flowering plant in the family Acanthaceae. It is a native of Mexico, the Caribbean, and South America.",
  "bromelia": "Bromelia is a genus of about 70 plant species widespread across Latin America and the West Indies. It is the type genus of the family Bromeliaceae, subfamily Bromelioideae, and its type species is B. karatas. Bromelia species are characterized by flowers with a deeply cleft calyx.",
  "blanket flower": "Gaillardia is a genus of flowering plants in the family Asteraceae, native to North and South America. It was named after Maître Gaillard de Charentonneau, an 18th-century French magistrate who was an enthusiastic botanist.",
  "trumpet creeper": "Campsis radicans, the trumpet vine, yellow trumpet vine, or trumpet creeper, is a species of flowering plant in the family Bignoniaceae, native to eastern North America, and naturalized elsewhere. Growing to 10 metres, it is a vigorous, deciduous woody vine, notable for its showy trumpet-shaped flowers.",
  "blackberry lily": "Iris domestica, commonly known as leopard lily, blackberry lily, and leopard flower, is an ornamental plant in the family Iridaceae. In 2005, based on molecular DNA sequence evidence, Belamcanda chinensis, the sole species in the genus Belamcanda, was transferred to the genus Iris and renamed Iris domestica."
}